Revit 2027 API
FamilySizeTableManager.CreateFamilySizeTableManager Method
 Adds FamilySizeTableManager to a Family. A FamilySizeTableManager and FamilySizeTables are only needed when importing, exporting, or removing size data previously stored in CSV files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CreateFamilySizeTableManager(
	Document document,
	ElementId familyId
)
Public Shared Function CreateFamilySizeTableManager (
	document As Document,
	familyId As ElementId
) As Boolean
public:
static bool CreateFamilySizeTableManager(
	Document^ document,
	ElementId^ familyId
)
static member CreateFamilySizeTableManager :
        document : Document *
        familyId : ElementId -> bool
Parameters
document Document
 Family owned document or project document.
familyId ElementId
 ElementId of the Family.
Return Value
Boolean
 True if successful, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace